<template>
    <q-page padding>
      <div class="text-body1 tamil">ஒரு செய்யுளை உள்ளீட்டு பெட்டியில் இட்டால், அவலோகிதம் அதன் சம்பந்தமான பல்வேறு யாப்பு உறுப்புகளை ஆராய்ந்து உடனடியாக வெளியிடும். இந்த மென்பொருள், <i>வெண்பா, ஆசிரியப்பா, கலிப்பா, வஞ்சிப்பா</i> முதலிய நால்வகைப்பாக்களையும் அதற்குரிய பாவினங்களையும் கண்டுகொள்ளும் திறன் கொண்டது.</div>

      <div class="text-h6 tamil q-mt-md"><b>மாறுபட்ட அலகிடல்</b></div>
      <div class="text-body1 tamil q-mt-sm">பல சயமங்களில், தளைதட்டும்போதோ வேண்டிய வாய்ப்பாடு வரவழைக்கவோ சில எழுத்துக்களை அலகிடாது விடுதல் வேண்டும். கீழ்க்கண்டவையை போல:<br/><br/>

      (அ) உயிரெழுத்துக்களுக்கு முன் வரும் குற்றியலுகரத்தை ஒற்றெழுத்தாக கருதி அலகிடாது விடுதல் வேண்டும்.<br/>
      (ஆ) ஆய்தத்தை குறில் எழுத்தாக அலகிடுதல் வேண்டும்<br/>
      (இ) உயிரளபெடையை நெட்டெழுத்தாக அலகிடுதல் வேண்டும்.<br/><br/>

      இவற்றை செயல்படுத்த மாறுபட்ட அலகிடலை தேர்ந்தெடுக்கவும்.

    </div>

      <div class="text-h6 tamil q-mt-md"><b>பா விதிகளோடு ஒப்பிடுதல்</b></div>
      <div class="text-body1 tamil q-mt-sm">தங்களுடைய இயற்றியச் செய்யுளை குறிப்பிட்ட பாவின் விதிகளோடு ஒப்பிட்டு அதன் முடிவுகளை வெளியிட, பாவினை உள்ளீட்டுப்பெட்டியின் கீழே தேர்வை செய்தபிறகு விதிகளோட பொருத்துக என்பதை தேர்வு செய்க.</div>

      <div class="text-h6 tamil q-mt-md"><b>செய்யுளின் பாவகை தவறுதலாக காட்டப்படுகிறது, என்ன செய்ய?</b>
      </div>
      <div class="text-body1 tamil q-mt-sm">மேலே குறிப்பிட்டுள்ள படி, குறிப்பிட்ட பாவினை தேர்வு செய்த பிறகு அனைத்தும் விதிகளும் பொருந்தி வருகிறதா எனப்பார்க்கவும். பாவிற்குரிய யாப்பு விதிகள் மீறப்படும் நிலையில், அதற்கு நெருங்கிய வகை காண்பிக்கப்படும். சில நேரங்களில் எந்தப்பாவகயும் பொருந்தாமல் போகலாம்.<br/><br/>

       இந்நேரங்களில் மாறுபட்ட அலகிடுதல் உதவக்கூடும். அல்லது, சில எழுத்துக்களை தேவைக்கேற்றார்ப்போல் அலகிடுதாது விடுதல் உதவும். உதாரணமாக, குறிப்பிட்ட சொற்களில் குற்றியலுகரத்தை ஒற்றெழுத்துப்போல அலகிடாது விடுதல். சில நேரங்களில் வகையுளி எனப்படும் வேறுபட்ட சீர் பிரித்தல் உதவும். உதாரணமாக, <i>காசும் கோடாமட</i> என்பது ஆசிரியத்தளை. ஆனால், <i>காசும்கோ டாமட</i> என்பது வெண்டளை. இவை அனைத்தும் பிரயோஜனப்படாதபட்சத்தில், உங்கள் பாவை விதி பொருந்தாத இடத்தில் தகுந்தவாறு மாற்றி அமைத்தல் வேண்டும்.

       </div>

      <div class="text-h6 tamil q-mt-md"><b>நான் விதிகளை பின்பற்றி சரியாக எழுதியும் பாவகை ஏன் சரியாக கண்டறியப்படவில்லை?</b>
      </div>
      <div class="text-body1 tamil q-mt-sm">இதற்கு காரணம் உண்டு. உதாரணமாக, யாப்பிலக்கணம் ஆசிரியப்பாவில் ஆசிரியத்தளை மிகுந்து வரவேண்டும் என்று தான் கூறுகிறது. 'மிகுந்து' என்பது எவ்வளவு என்று சொல்லப்படவில்லை. ஆனால், கணினியில் அவ்வாறு செய்ய இயலாது. எவ்வளவு சதவீதம் ஆசிரியத்தளை இருந்தால் மிகுந்து வருவதாக கருத வேண்டும் என்று அதனிடம் கூற வேண்டும்.
       </div>
      <div class="text-body1 tamil q-mt-sm">உதாரணமாக, அவலோகிதம் ஒரு பாவில் 40%க்கு மேல் ஆசிரியத்தளை இருந்தால், அத்தளை மிகுந்து வந்ததாக கொள்ளும். ஆக, நீங்கள் 39% சதவீதம் ஆசிரியத்தளை கொண்ட ஒரு பாவை இயற்றினால் அதை ஆசிரியப்பாவாக கொள்ளாது. இது கணினியின் தவறே தவிர, உங்கள் தவறு கிடையாது.
       </div>
      <div class="text-h6 tamil q-mt-md"><b>நம் விருப்பப்படி அலகிடுவது எப்படி?</b></div>
      <div class="text-body1 tamil q-mt-sm">குறிப்பிட்ட விதத்திலான அலகிடுதலை செயல்படுத்த, / குறியை இட்டு, அசை பிரித்த சொல்லாக உள்ளீடு கொடுக்கவும். <br/><br/>

      உதாரணமாக: <i>க/லை/யோடு/</i> என்றவாறு.</div>

      <div class="text-h5 tamil q-mt-md"><b>API</b></div>
      <div class="text-body1 tamil q-mt-sm">இம்மென்பொருளுக்கு REST API'யும் உள்ளது. http://www.avalokitam.com/api.php என்ற வலைத்தள முகவரிக்கு கீழ்க்கண்ட parameter உடன் ஒரு GET அல்லது POST request செய்தால், ஓர் XML கோப்பு திருப்பி அனுப்பப்படும்.<br/><br/>

      <i>verse : உரை தமிழ் யூனிகோடில்</i></div>
  </q-page>
</template>

<script>
export default {
  // name: 'PageName',
  data () {
    return {
    }
  }
}
</script>

<style scoped>
.quote {
  text-align: left;
  margin-right: 0px;
  color: #777;
  font-style:italic;
  font-size:14px;
  line-height:20px;
}
</style>
